app/controllers/api/v1/notes_controller.rb

SELECT "notes".* FROM "notes"
---
	def index
		# @notes = Note.all.sort {|a,b| a.id <=> b.id }
		@notes = Note.all

INSERT INTO "notes" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "Brad is here"], ["created_at", "2018-11-03 17:09:56.477125"], ["updated_at", "2018-11-03 17:09:56.477125"]]
---
	def create
		@note = Note.create(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "id" = $1, "body" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["id", 1], ["body", "The ASDF (Vanilla JS) and backend (Rails API) will reside in two separate repos"], ["updated_at", "2018-11-04 20:19:23.677752"], ["id", 2]]
---
	def update
		@note = Note.find(params[:id])
		@note.update(note_params)